"""
1.3 Структура веб-страницы

Далее мы рассмотрим несколько способов поиска элементов внутри страницы:
1) Поиск с помощью CSS-селекторов, когда путь к элементу описывается через синтаксис CSS. Селектор — это описание пути к элементу на странице.
2) Поиск с помощью указания значений тегов или атрибутов элементов: ID, class, и т.д.
3) Поиск с помощью языка запросов XPath

Также нам понадобится знание трёх особенностей языка HTML:
Страница на языке HTML состоит из элементов, начало и конец элемента задаются с помощью специальных пометок – тегов (tag);
У тегов есть атрибуты, которые определяют свойства элементов;
Страница на языке HTML имеет иерархическую структуру.

Основные атрибуты
id уникальный идентификатор элемента на странице
title всплывающая подсказка при наведении
href адрес, куда ведёт ссылка
target как открыть ссылку: в текущем окне или новом
src источник изображения, путь к изображению/видео/файлу
placeholder текст внутри поля, исчезающий при вводе
required поле обязательно для заполнения
type тип вводимых данных
checked выбран ли checkbox/radio заранее
disabled элемент заблокирован

"""